#=======================================================================#
# Taps                                                                  #
#=======================================================================#

# Taps
tap "homebrew/bundle"

#=======================================================================#
# App Store                                                             #
#=======================================================================#

# Xcode
mas "Xcode", id: 497799835

# Keynote, Numbers, Pages
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541

# Others
mas "Amphetamine", id: 937984704

#=======================================================================#
# Casks                                                                 #
#=======================================================================#
cask_args no_quarantine: true

# Terminal
cask "iterm2"
# cask "warp"

# Browser
cask "google-chrome"
cask "arc"
# cask "firefox"
# cask "microsoft-edge"
# cask "tor-browser"

# Editor
cask "visual-studio-code"
# cask "boostnote"
# cask "mathpix-snipping-tool"

# Git
# cask "fork"
# cask "sourcetree"
# cask "github"
cask "git-credential-manager"

# IM
# cask "aliwangwang"
cask "wechat"
# cask "qq"
cask "slack"
cask "telegram"
cask "discord"
# cask "signal"

# Work
# cask "wechatwork"
# cask "dingtalk"

# Music
# cask "qqmusic"
# cask "neteasemusic"

# Proxy
# cask "v2rayu"
# cask "qv2ray"
# cask "shadowsocksx-ng"
# cask "openvpn-connect"
# cask "tunnelblick"
cask "mitmproxy"
cask "clash-verge-rev"
# cask "mihomo-party"

# Dev Tools
# cask "insomnia"
# cask "postman"
# cask "wireshark"
# cask "beekeeper-studio"
# cask "dash"
# cask "wechatwebdevtools"
# cask "switchhosts"
# cask "xtool-org/tap/xtool"

# Menu Bar
# cask "itsycal"
# cask "bitbar"

# Containers & Kubernetes
# cask "docker" # https://github.com/docker/for-mac/issues/7339#issuecomment-2196829908
# cask "podman-desktop"
# cask "rancher"
# cask "orbstack"
# cask "finch"

# Video Player
# cask "mpv"
# cask "iina"

# Audio Player
# cask "vox"

# Others
# cask "appcleaner"
# cask "blurred"

# Compression
cask "the-unarchiver"

# Productivity
# cask "alfred"
cask "rectangle"
cask "cheatsheet"
# cask "alt-tab"

# Display
cask "monitorcontrol"
# cask "lunar"

# Settings
# cask "onyx"

# Screen Recorder
# cask "kap"

# Adobe
# cask "adobe-creative-cloud"
# cask "adobe-creative-cloud-cleaner-tool"

# Android
cask "android-studio"

# Flutter
cask "flutter"

# Julia
# cask "julia"

# Virtual Machine
cask "virtualbox"
cask "vagrant"

# Office
# cask "microsoft-office"

# Fonts
cask "font-meslo-lg-nerd-font"

#=======================================================================#
# Formulae                                                              #
#=======================================================================#

# Mac App Store
brew "mas"

# Touch ID
brew "pam-reattach"

# Shell
brew "bash"
brew "zsh"
brew "zplug"
# brew "fish"

# File System
brew "eza"
brew "yazi"

# Pager
brew "less"

# Git
brew "git"
brew "git-filter-repo"
# brew "git-flow"
brew "git-flow-avh"
brew "git-lfs"
brew "git-extras"
brew "git-credential-oauth"
brew "git-delta"
brew "jesseduffield/lazygit/lazygit"

# GitHub
# brew "gh"
# brew "hub"
brew "act"

# GitLab
# brew "glab"
# brew "lab"

# Editor
brew "vim"
brew "neovim"
# brew "bat"

# Multiplexer
brew "tmux"
brew "screen"

# Network Tools
brew "httpie"
brew "curl"
brew "wget"
brew "socat"
brew "mtr"
brew "wireguard-tools"

# Text Finder
brew "ack"
brew "the_silver_searcher"

# Fuzzy Finder
brew "fzf"

# Navigation
brew "autojump"
brew "z"

# Virtual Machine
brew "qemu"
brew "lima"

# Database
brew "mysql"
brew "postgresql@18"

# JSON
brew "jq"

# YAML
brew "yq"

# HTML
brew "recode"

# Command Correction
brew "thefuck"

# Defaults
brew "duti"

# Proxy
# brew "xray"
# brew "trojan-gfw/homebrew-trojan/trojan"

# Encryption
brew "gnupg"

# Infrastructure
brew "hashicorp/tap/terraform"
brew "opentofu"
brew "pulumi"
brew "terragrunt"

# Containers & Kubernetes
brew "docker"
brew "docker-compose"
brew "docker-buildx"
brew "podman"
brew "skopeo"
brew "dive"
brew "kubernetes-cli"
brew "helm"
brew "kind"
brew "minikube"
# brew "kubectx"
# brew "kubeseal"
brew "colima"
brew "kubeseal"

# Ctags
brew "ctags"

# Version Manager
brew "asdf"

# Shell Script
brew "shellcheck"
brew "shfmt"
brew "bats-core"

# Node
brew "node"
brew "fnm"
brew "nodenv"
brew "nodenv/nodenv/node-build-update-defs"
brew "nodenv/nodenv/nodenv-npm-migrate"
brew "nodenv/nodenv/nodenv-nvmrc"
brew "nodenv/nodenv/nodenv-package-json-engine"
brew "manlao/tap/node-build-aliases"
brew "manlao/tap/nodenv-auto-install"

# Deno
# brew "deno"

# Bun
brew "oven-sh/bun/bun"

# Dart
# brew "dart"

# Python
brew "uv"
brew "python"
brew "pipx"
brew "pyenv"
brew "pyenv-pip-migrate"

# Ruby
brew "ruby"
brew "rbenv"
brew "cocoapods"

# Java
# brew "openjdk"
brew "jenv"

# Rust
brew "rustup-init"
# brew "rust"

# Go
brew "go"
brew "goenv"

# PHP
# brew "php"

# Kotlin
# brew "kotlin"

# Scala
# brew "scala"

# Dev Tools
brew "watchman"
